run/pressure_parallel_plate/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)  //the top side
        );
    }
    bottomWall

    {
        type wall;
        faces
        (
            (1 5 4 0) //the bottom side
        );
    }
    leftSide
    {
        type patch;
        faces
        (
            (0 4 7 3) //the left side
        );
    }
    rightSide
    {
        type patch;
        faces
        (
            (2 6 5 1) //the right side
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1) //z == 0
            (4 5 6 7) //z == 0.1
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
